app/controllers/admin/entries_controller.rb

  def index
    @entries = Entry.all
---
SELECT * FROM `entries`

  def show
    @entry = Entry.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 11)

  def edit
    @entry = Entry.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 1)

  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO `entries` (`name`, `round_id`, `updated_at`, `url`, `user_id`, `created_at`) VALUES('Schmap Guides', 20, '2009-08-14 22:12:48', 'http://blog.brandonschory.com/2009/08/schmap-guides/', 1, '2009-08-14 22:12:48')

  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 1)
UPDATE `entries` SET `updated_at` = '2009-09-07 23:39:16', `name` = 'The Best Parking Job in the World' WHERE `id` = 14