app/controllers/admin/rounds_controller.rb

  def index
    @rounds = Round.all
---
SELECT * FROM `rounds` ORDER BY id DESC

  def show
    @round = Round.find(params[:id])
---
SELECT * FROM `rounds` WHERE (`rounds`.`id` = 1)

  def edit
    @round = Round.find(params[:id])
---
SELECT * FROM `rounds` WHERE (`rounds`.`id` = 1)

  def create
    @round = Round.new(params[:round])

    respond_to do |format|
      if @round.save
---
INSERT INTO `rounds` (`updated_at`, `created_at`) VALUES('2009-08-14 22:06:43', '2009-08-14 22:06:00')

  def update
    @round = Round.find(params[:id])

    respond_to do |format|
      if @round.update_attributes(params[:round])
---
SELECT * FROM `rounds` WHERE (`rounds`.`id` = 1)
UPDATE `rounds` SET `created_at` = '2009-08-14 22:10:00', `updated_at` = '2009-08-14 22:10:24' WHERE `id` = 1