app/controllers/admin/user_roles_controller.rb

  def index
    @user_roles = UserRole.find(:all)
---
SELECT * FROM `user_roles` WHERE (`user_roles`.`id` = 3)

  def show
    @user_role = UserRole.find(params[:id])
---
SELECT * FROM `user_roles` WHERE (`user_roles`.`id` = 3)

  def edit
    @user_role = UserRole.find(params[:id])
---
SELECT * FROM `user_roles` WHERE (`user_roles`.`id` = 3)

  def update
    @user_role = UserRole.find(params[:id])

    respond_to do |format|
      if @user_role.update_attributes(params[:user_role])
---
SELECT * FROM `user_roles` WHERE (`user_roles`.`id` = 3)
UPDATE `user_roles` SET `permissions` = 3, `updated_at` = '2009-08-08 16:35:42' WHERE `id` = 1