app/controllers/admin/users_controller.rb

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 7)
UPDATE `users` SET `updated_at` = '2009-09-08 00:55:40', `role_id` = 0, `last_seen` = '2009-09-08 00:55:40' WHERE `id` = 1