app/controllers/admin_controller.rb

SELECT * FROM `users`
SELECT * FROM `user_roles`
SELECT * FROM `entries`
SELECT * FROM `rounds`
---
  def index
    @users = User.all
    @user_roles = UserRole.all
    @entries = Entry.all
    @rounds = Round.all