app/controllers/entries_controller.rb

  def load_user
    @user = User.find(logged_in_user.id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 7)

  def show
    @entry = Entry.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 1)

  def edit
    @entry = Entry.find(params[:id])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 10)

  def create
    if @user.up_to_date?
      @round = Round.new
    else
      @round = Round.find(params[:entry, :round])
    end
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @round.save and @entry.save
---
SELECT * FROM `rounds` WHERE (`rounds`.`id` = 18)
INSERT INTO `entries` (`name`, `round_id`, `updated_at`, `url`, `user_id`, `created_at`) VALUES('ewew', 18, '2009-08-14 22:59:26', 'ewewe', 7, '2009-08-14 22:59:26')
INSERT INTO `rounds` (`created_at`, `updated_at`) VALUES('2009-09-08 00:47:16', '2009-09-08 00:47:16')

  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 1)
UPDATE `entries` SET `updated_at` = '2009-09-07 23:45:54', `round_id` = 21, `name` = '\"Cranialsacral Therapy\" or \"Why I\'m Falling Behind\"' WHERE `id` = 4

  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy
---
SELECT * FROM `entries` WHERE (`entries`.`id` = 23)
DELETE FROM `entries` WHERE `id` = 23