app/controllers/login_controller.rb

SELECT * FROM `users` WHERE (email = 'rachelober@gmail.com') LIMIT 1
UPDATE `users` SET `password_hash` = '0ee68a62bf00d9f6491043a2fdeda62c720dc3fe', `updated_at` = '2009-08-08 15:28:26', `last_seen` = '2009-08-08 15:28:26', `password_salt` = '198315000.517017605828165' WHERE `id` = 7
---
  def send_password
    @user = User.find(:first, :conditions => ['email = ?', params[:email]])
    #@user.password_reset = true
    new_password = [Array.new(8){rand(256).chr}.join].pack("m").chomp
    puts new_password
    @user.password = new_password

    if @user.update_attribute(:password, new_password)