app/controllers/rounds_controller.rb

  def show
    @round = Round.find(params[:id])
    @entries = Entry.find(:all, :conditions => ["round_id = ?", @round], :order => ["created_at DESC"])
    @users = User.find(:all)
    @waiting = @users.delete_if {|x| @round.users.include?(x) }
---
SELECT * FROM `rounds` WHERE (`rounds`.`id` = 1)
SELECT * FROM `entries` WHERE (round_id = 20) ORDER BY created_at DESC
SELECT * FROM `users` WHERE (`users`.`id` = 7)
SELECT `users`.id FROM `users` INNER JOIN `entries` ON `users`.id = `entries`.user_id WHERE (`users`.`id` = 1) AND ((`entries`.round_id = 3)) LIMIT 1

  def edit
    @round = Round.find(params[:id])
---
SELECT * FROM `rounds` WHERE (`rounds`.`id` = 1)

  def update
    @round = Round.find(params[:id])

    respond_to do |format|
      if @round.update_attributes(params[:round])
---
SELECT * FROM `rounds` WHERE (`rounds`.`id` = 1)
UPDATE `rounds` SET `start_date` = '2009-08-08 04:11:00', `updated_at` = '2009-08-08 04:11:19' WHERE `id` = 1